Public Attributes | List of all members
API_StairTreadQuantity Struct Reference
Element Manager API
Calculated values for a stair tread. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | area
Top surface area of the given tread.
double  | volume
Volume of the given tread.
double  | thickness
Thickness of the given tread.
double  | elevation
Elevation to project zero.
Int32  | stepIndex
Step index of the given tread.
Int32  | filler
Detailed Description
Calculated values for a stair tread.
Member Data Documentation
◆ area
 API_StairTreadQuantity::area
Top surface area of the given tread.
◆ elevation
 API_StairTreadQuantity::elevation
Elevation to project zero.
◆ filler
 Int32 API_StairTreadQuantity::filler
◆ stepIndex
 API_StairTreadQuantity::stepIndex
Step index of the given tread.
◆ thickness
 API_StairTreadQuantity::thickness
Thickness of the given tread.
◆ volume
 API_StairTreadQuantity::volume
Volume of the given tread.